# 1. Берем за основу официальный, легкий и чистый Linux с уже установленным Python
FROM python:3.12-slim

# 2. Устанавливаем системные программы (наш любимый FFmpeg для извлечения звука)
RUN apt-get update && apt-get install -y ffmpeg && rm -rf /var/lib/apt/lists/*

# 3. Говорим Докеру: "Создай папку /app внутри контейнера и работай дальше из неё"
WORKDIR /app

# 4. Копируем наш "список покупок" внутрь и устанавливаем библиотеки
COPY requirements.txt .
RUN pip install --no-cache-dir -r requirements.txt

# 5. Копируем все остальные файлы (твои скрипты и .env) внутрь контейнера
COPY . .

# 6. На всякий случай создаем папку для видео
RUN mkdir -p downloads

# 7. Команда по умолчанию: когда контейнер запустится, открой нам обычный терминал
CMD ["/bin/bash"]

